# Task:
For part 3 of the project you will be  applying an E.T.L process on your previously saved movie data. Specifically, you will create a new MySQL database after preparing the data for a relational database. You will export your database to a .sql file in your repository using MySQL Workbench.

## Specifications - Database
Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project, and wants you to create a MySQL database for them.

Specifically, they want the data from the following files included in your database:

- Title Basics:
    - Movie ID (tconst)
    - Primary Title
    - Start Year
    - Runtime (in Minutes)
    - Genres
- Title Ratings:
    - Movie ID (tconst)
    - Average Movie Rating
    - Number of Votes
- The TMDB API Results (multiple files)
    - Movie ID
    - Revenue
    - Budget
    - Certification (MPAA Rating)

## Required Transformation Steps for Title Basics:
- **Normalize Genre:**
    - Convert the single string of genres from title basics into 2 new tables.
        1. title_genres: with the columns:
            - tconst
            - genre_id
        2. genres:
            - genre_id
            - genre_name

- **Discard unnecessary information:**
    - For the title basics table, drop the following columns:
        - "original_title" (we will use the primary title column instead)
        - "isAdult" ("Adult" will show up in the genres so this is redundant information).
        - "titleType" (every row will be a movie).
        - "genres" and other variants of genre (genre is now represented in the 2 new tables described above.
    - Do not include the title_akas table in your SQL database.
        - You have already filtered out the desired movies using this table and the remaining data is mostly nulls and not of-interest to the stakeholder.

## MySQL Database Requirements
- Use sqlalchemy with pandas to execute your SQL queries inside your notebook.

- Create a new database on your MySQL server and call it "movies".

- Make sure to have the following tables in your "movies" database:
    - title_basics
    - title_ratings
    - title_genres
    - genres
    - tmdb_data
- Make sure to set a Primary Key for each table that isn't a joiner table (e.g. title_genres is a joiner table).

- After creating each table, show the first 5 rows of that table using a SQL query.

- Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

In [1]:
# Imports
import pandas as pd
import numpy as np
import json
import pymysql
from sqlalchemy import create_engine
from urllib.parse import quote_plus
from sqlalchemy_utils import create_database, database_exists
pd.set_option('display.max_columns', None)

# Load Project 3 Part 2 dataframes

In [2]:
# Load combined df from Project 3 (Part 2) and preview
df = pd.read_csv('C:\\Users\\Chris Palisoc\\Documents\\Coding Dojo\\Coding Dojo Project 3\\Project3\\Data\\tmdb_results_combined.csv.gz')
df.info()
df.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4507 entries, 0 to 4506
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                4507 non-null   object
 1   adult                  4505 non-null   float64
 2   backdrop_path          2041 non-null   object
 3   belongs_to_collection  253 non-null    object
 4   budget                 4505 non-null   float64
 5   genres                 4505 non-null   object
 6   homepage               230 non-null    object
 7   id                     4505 non-null   float64
 8   original_language      4505 non-null   object
 9   original_title         4505 non-null   object
 10  overview               4157 non-null   object
 11  popularity             4505 non-null   float64
 12  poster_path            3870 non-null   object
 13  production_companies   4505 non-null   object
 14  production_countries   4505 non-null   object
 15  release_date           4465 non-null   object
 16  revenue                4505 non-null   float64
 17  runtime                4505 non-null   float64
 18  spoken_languages       4505 non-null   object
 19  status                 4505 non-null   object
 20  tagline                1287 non-null   object
 21  title                  4505 non-null   object
 22  video                  4505 non-null   float64
 23  vote_average           4505 non-null   float64
 24  vote_count             4505 non-null   float64
 25  certification          832 non-null    object
dtypes: float64(9), object(17)
memory usage: 915.6+ KB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,Two rural teens sing and dance their way throu...,2.623,/hfO64mXz3DgUxkBVU7no2UWRP7x.jpg,"[{'id': 51207, 'logo_path': None, 'name': 'Sul...","[{'iso_3166_1': 'US', 'name': 'United States o...",2000-09-22,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN

In [3]:
# load and preview title_basics df
basicsfile = 'C:\\Users\\Chris Palisoc\\Documents\\Coding Dojo\\Coding Dojo Project 3\\Project3\\Data\\title_basics.csv.gz'
title_basics_df = pd.read_csv(basicsfile)
title_basics_df.info()
title_basics_df.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86303 entries, 0 to 86302
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86303 non-null  object
 1   titleType       86303 non-null  object
 2   primaryTitle    86303 non-null  object
 3   originalTitle   86303 non-null  object
 4   isAdult         86303 non-null  int64
 5   startYear       86303 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86303 non-null  int64
 8   genres          86303 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 5.9+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama

In [4]:
# load and preview title_ratings df
ratingsfile = 'C:\\Users\\Chris Palisoc\\Documents\\Coding Dojo\\Coding Dojo Project 3\\Project3\\Data\\title_ratings.csv.gz'
title_ratings_df = pd.read_csv(ratingsfile)
title_ratings_df.info()
title_ratings_df.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 495070 entries, 0 to 495069
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         495070 non-null  object
 1   averageRating  495070 non-null  float64
 2   numVotes       495070 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.3+ MB

      tconst  averageRating  numVotes
0  tt0000001            5.7      1965
1  tt0000002            5.8       262

# Clean dataframes with only requested data

In [5]:
# keep selected columns from 'Title Basics' df and check
title_basics_df = title_basics_df.drop(columns=['titleType', 'originalTitle', 'isAdult', 'endYear'])
title_basics_df.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama
2,tt0069049,The Other Side of the Wind,2018,122,Drama
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002,126,Drama

In [6]:
# keep selected columns from 2000 & 2001 df and check
df = df.loc[:, ['imdb_id', 'revenue', 'budget', 'certification']]
df.head(10)

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0116748         0.0         0.0           NaN
5  tt0118694  12854953.0    150000.0            PG
6  tt0118852         0.0         0.0             R
7  tt0119273         0.0  15000000.0             R
8  tt0119495         0.0         0.0             R
9  tt0119806         0.0         0.0           NaN

In [7]:
# check 'Title Ratings' df
title_ratings_df.head(2)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1965
1  tt0000002            5.8       262

# 1. Normalizing Genres

## Getting List of Unique Genres

In [8]:
# create a column w/a list of genres and display
title_basics_df['genres_split'] = title_basics_df['genres'].str.split(',')
title_basics_df

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,Crime and Punishment,2002,126,Drama,[Drama]
...,...,...,...,...,...,...
86298,tt9914942,Life Without Sara Amat,2019,74,Drama,[Drama]
86299,tt9915872,The Last White Witch,2019,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
86300,tt9916170,The Rehearsal,2019,51,Drama,[Drama]
86301,tt9916190,Safeguard,2020,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
86302,tt9916362,Coven,2020,92,"Drama,History","[Drama, History]"

In [9]:
# separate list of genres into rows for each movie it belonged to
exploded_genres = title_basics_df.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018,122,Drama,Drama
...,...,...,...,...,...,...
86301,tt9916190,Safeguard,2020,95,"Action,Adventure,Thriller",Action
86301,tt9916190,Safeguard,2020,95,"Action,Adventure,Thriller",Adventure
86301,tt9916190,Safeguard,2020,95,"Action,Adventure,Thriller",Thriller
86302,tt9916362,Coven,2020,92,"Drama,History",Drama
86302,tt9916362,Coven,2020,92,"Drama,History",History

In [10]:
# get string column converted to a list of strings in each row
genres_split = title_basics_df['genres'].str.split(',')

In [11]:
# explode series and take the unique entries only
unique_genres = genres_split.explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror', 'Sci-Fi',
       'Biography', 'Mystery', 'Musical', 'Action', 'Adventure', 'Crime',
       'Thriller', 'Music', 'Animation', 'Family', 'History', 'War',
       'Sport', 'Western', 'Adult', 'Short', 'Reality-TV', 'News',
       'Talk-Show', 'Game-Show'], dtype=object)

In [12]:
# sort unique_genres alphabetically
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

## Create a new title_genres table

In [13]:
# create title_genres with 'tconst' and 'genres_split' columns
title_genres = exploded_genres[['tconst' , 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

## Create genre mapper dictionary to replace string genres w/integers

In [14]:
# make genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [15]:
# make a dictionary w/list of unique genres as the key and new integer id as values
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

## Replace the string genres in 'title_genres' w/the new integer id's

In [16]:
# make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

## Convert genre map dictionary into a df

In [17]:
# manually make df w/named columns from the .keyd and .values
genres = pd.DataFrame({'Genre_Name': genre_id_map.keys(),
                            'Genre_ID': genre_id_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# 2. Save the MySQL tables w/tconst as the primary key

## Create a dataype schema for to_sql

In [18]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_basics_df['tconst'].fillna('').map(len).max()
title_len = title_basics_df['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_basics_df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [19]:
# schema for title_ratings_df
key_len = title_ratings_df['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_ratings_df_schema = {
    "tconst": String(key_len+1), 
    "averageRating": Float(),
    'numVotesratings':Integer()}

In [20]:
# schema for df
key_len = df['imdb_id'].fillna('').map(len).max()
cert_len = df['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1), 
    "revenue": Float(),
    "budget": Float(),
    'certification': Text(cert_len+1)}

## Run df.to_sql w/dtype argument

In [21]:
# create SQL connection
username = 'root'
password = quote_plus('81764$Cp')
db_name = 'movies'
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'
# create engine
engine = create_engine(connection)

In [22]:
# check if database exists, if not, create it
if database_exists(connection):
                  print('it exists')
else:
    create_database(connection)
    print('database created')

it exists

In [23]:
# forgot to initially drop 'genres' and 'genres_split' from title_basics_df
title_basics_df = title_basics_df.drop(columns = ['genres' , 'genres_split'])
title_basics_df.head(2)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70

In [24]:
# Save to sql with dtype and index=False
title_basics_df.to_sql('title_basics',engine,dtype=title_basics_df_schema,if_exists='replace',index=False)
title_ratings_df.to_sql('title_ratings',engine,dtype=title_ratings_df_schema,if_exists='replace',index=False)
df.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)
genres.to_sql('genres',engine,if_exists='replace',index=False)
title_genres.to_sql('title_genres',engine,if_exists='replace',index=False)

161184

## Run the query to add primary key

In [25]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

## Display Tables

In [26]:
# show the first 5 rows of all tables
q = """
SELECT *
FROM genres
LIMIT 5
"""
pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [27]:
q = """
SELECT *
FROM title_basics
LIMIT 5
"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [28]:
q = """
SELECT *
FROM title_genres
LIMIT 5
"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [29]:
q = """
SELECT *
FROM title_ratings
LIMIT 5
"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1965
1  tt0000002            5.8       262
2  tt0000005            6.2      2604
3  tt0000006            5.1       179
4  tt0000007            5.4       816

In [30]:
q = """
SELECT *
FROM tmdb_data
LIMIT 5
"""
pd.read_sql(q, engine)

     imdb_id  revenue      budget certification
0          0      NaN         NaN          None
1  tt0113026      0.0  10000000.0          None
2  tt0113092      0.0         0.0          None
3  tt0116391      0.0         0.0          None
4  tt0116748      0.0         0.0          None

In [31]:
# display all tables created
q="""
SHOW TABLES;
"""
pd.read_sql(q,engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data